print("{} {}".format("hello","world","aa"))#如果不加参数将按format中的参数依次填满{}如果参数不够将报错，多了将不显示多的部分
print("{1} {0}".format("world","hello"))#使用位置参数，将format中的参数从0开始依次排序，根据{}中的数字决定参数位置
print("{a} {b}".format(a="hello",b="world"))#使用关键字参数
print("{0} {a}".format("hello",a="world"))#位置参数必须在关键字参数之前，否则报错
print("{{}}".format("不打印"))#打印花括号方法，花括号被其中花括号转义故参数不打印
print("{{hello world}}".format("aaa"))
print("{0:.1f}{1}".format(3.1415926,'π'))#使用冒号表示输入格式，格式化数据，字符类型格式和c语言类似，具有四舍五入
print ( "%c" % 97 )#将数值格式化为字符型，97的ascii码为a
print('%c %c %c ' % (97,98,99))#具有%c,%s,%d,%o,%x,%X(大写十六进制)，%f,%e,%E(同%e),%g(根据数值大小自动判断使用%f还是%e),%G(同g)
#m.n,m表示显示最小总宽度，n表示小数点后位数，同c语言
print('%5.1f' % 3.142)
print('%-10d' % 5 )#-表示左对齐，+表示正负数前显示符号，‘#’号同c语言%#o表示八进制，%#x表示十六进制，%#d代表十进制
print('%05d' % 5)#0表示用0填充空位
print('%-010d' % 5)#左对齐后不用0填充，防止异意
#转义字符含义，\'单引号，\"双引号，\a系统响铃，\b退格符，\n换行符，\t横向制表符，\v纵向制表符，\r回车符，\f换页符，\o八进制数代表符，\x十六进制代表符，\0表示空字符,\\反斜杠



